Comum/ControlaWebServices/WSDL/GTEC_SI_FaturamentoLogistico_Async_Outb_x_x.wsdl

<?xml version="1.0" encoding="UTF-8"?><wsdl:definitions name="SI_FaturamentoLogistico_Async_Outb" targetNamespace="urn:cielo:sap:gtec:faturamentoLogistico" xmlns:p1="urn:cielo:sap:gtec:faturamentoLogistico" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"><wsdl:documentation/><wsp:UsingPolicy wsdl:required="true"/><wsp:Policy wsu:Id="OP_SI_FaturamentoLogistico_Async_Outb"/><wsdl:types><xsd:schema targetNamespace="urn:cielo:sap:gtec:faturamentoLogistico" xmlns="urn:cielo:sap:gtec:faturamentoLogistico" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><xsd:element name="MT_FaturamentoLogisticoOutb" type="DT_FaturamentoLogisticoOutb"/><xsd:complexType name="DT_FaturamentoLogisticoOutb"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/VersionID">472a7a710bf411ec9fbb0000070e266a</xsd:appinfo></xsd:annotation><xsd:sequence><xsd:element name="dados" minOccurs="0" maxOccurs="unbounded"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">793f705a9df611eba27c543411e43e08</xsd:appinfo></xsd:annotation><xsd:complexType><xsd:sequence><xsd:element name="tipoDeServicoCod" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">793d25009df611ebbb77543411e43e08</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="tipoDeServicoDesc" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">793d25019df611eb8895543411e43e08</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="evento" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">793d25029df611eb904c543411e43e08</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="assistenciaTecnica" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">793d25039df611eb9fc1543411e43e08</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="filial" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">793d25049df611ebcbed543411e43e08</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="status" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">793d25059df611eba3aa543411e43e08</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="tipoDeOcorrenciaCod" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">793d25069df611eba283543411e43e08</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="tipoDeOcorrenciaDesc" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">793d25079df611eb8f85543411e43e08</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="ocorrenciasCod" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">793d25089df611eb8591543411e43e08</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="ocorrenciasDesc" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">793d25099df611eb8dc7543411e43e08</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="numDoChamadoGtec" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">793d250a9df611ebbaff543411e43e08</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="SequenChamadoGTeC" type="xsd:string" minOccurs="0"/><xsd:element name="chamadoEds" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">82b5a641adda11ebbc66541aef6c4d01</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="servContratadoCod" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">793d250b9df611eb9ffd543411e43e08</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="servContratadoDesc" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">793d250c9df611eb8505543411e43e08</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="tipo" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">793d250d9df611eba2a1543411e43e08</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="cidade" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">793d250e9df611eb8eaa543411e43e08</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="uf" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">793d250f9df611eb91f5543411e43e08</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="tempoDeAtend" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">793d25109df611eb8093543411e43e08</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="dataContraOrdem" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">793d25119df611ebae97543411e43e08</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="baixaSistema" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">9bdc60c69ee211ebb965543411e43e08</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="dataBaixa" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">793d25129df611ebbf38543411e43e08</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="baixaSLA" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">793d25139df611eb881e543411e43e08</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="baixaOS" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">793d25149df611ebba89543411e43e08</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="envio" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">793d25159df611eb9a15543411e43e08</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="prevista" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">793d25169df611ebb372543411e43e08</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="tempoRealAtend" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">793d25179df611ebc0f7543411e43e08</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="dhPrevista2Tentativa" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">793d25189df611eb9072543411e43e08</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="dhPrevistaUltimaTentativa" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">793d25199df611ebc92b543411e43e08</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="dcMotivoMemo" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">793d251a9df611eb9324543411e43e08</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="nLogico" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">793d251b9df611eb9fb0543411e43e08</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="maquineta" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">793d251c9df611ebaac4543411e43e08</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="capital" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">793d251d9df611eb9c1f543411e43e08</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="atraso" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">793d251e9df611eb83d4543411e43e08</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="motRetornoCod" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">793d251f9df611ebc116543411e43e08</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="motRetornoDesc" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">793d25209df611ebc109543411e43e08</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="codManutencao" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">793d25219df611ebb09f543411e43e08</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="dcObservacao" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">793d25229df611eb9188543411e43e08</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="qtRncd" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">793d25239df611ebcb48543411e43e08</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="dh1Tentativa" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">793d25249df611eb9e5f543411e43e08</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="dh2Tentativa" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">793d25259df611eb8988543411e43e08</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="quantidade" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">473d936d0bf411ecce1400090ffe0001</xsd:appinfo></xsd:annotation></xsd:element></xsd:sequence></xsd:complexType></xsd:element></xsd:sequence></xsd:complexType></xsd:schema></wsdl:types><wsdl:message name="MT_FaturamentoLogisticoOutb"><wsdl:documentation/><wsdl:part name="MT_FaturamentoLogisticoOutb" element="p1:MT_FaturamentoLogisticoOutb"/></wsdl:message><wsdl:portType name="SI_FaturamentoLogistico_Async_Outb"><wsdl:documentation/><wsdl:operation name="SI_FaturamentoLogistico_Async_Outb"><wsdl:documentation/><wsp:Policy><wsp:PolicyReference URI="#OP_SI_FaturamentoLogistico_Async_Outb"/></wsp:Policy><wsdl:input message="p1:MT_FaturamentoLogisticoOutb"/></wsdl:operation></wsdl:portType><wsdl:binding name="SI_FaturamentoLogistico_Async_OutbBinding" type="p1:SI_FaturamentoLogistico_Async_Outb"><soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"/><wsdl:operation name="SI_FaturamentoLogistico_Async_Outb"><soap:operation soapAction="http://sap.com/xi/WebService/soap1.1" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"/><wsdl:input><soap:body use="literal" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"/></wsdl:input></wsdl:operation></wsdl:binding><wsdl:service name="GTEC_SI_FaturamentoLogistico_Async_Outb_x_x"><wsdl:port name="HTTP_Port" binding="p1:SI_FaturamentoLogistico_Async_OutbBinding"><soap:address location="http://cbmphordpi1.cbmp.corp:51100/XISOAPAdapter/MessageServlet?senderParty=&amp;senderService=GTEC&amp;receiverParty=&amp;receiverService=&amp;interface=SI_FaturamentoLogistico_Async_Outb&amp;interfaceNamespace=urn%3Acielo%3Asap%3Agtec%3AfaturamentoLogistico" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"/></wsdl:port><wsdl:port name="HTTPS_Port" binding="p1:SI_FaturamentoLogistico_Async_OutbBinding"><soap:address location="https://cbmphordpi1.cbmp.corp:51101/XISOAPAdapter/MessageServlet?senderParty=&amp;senderService=GTEC&amp;receiverParty=&amp;receiverService=&amp;interface=SI_FaturamentoLogistico_Async_Outb&amp;interfaceNamespace=urn%3Acielo%3Asap%3Agtec%3AfaturamentoLogistico" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"/></wsdl:port></wsdl:service></wsdl:definitions>